v2506/run/verification-studies/diederichsen-and-hatton/fig3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;
startFrom           latestTime;
startTime           0;
stopAt              endTime;
endTime             100;
deltaT              1;
writeControl        timeStep;
writeInterval       50;
purgeWrite          0;
writeFormat         ascii;
writePrecision      12;
writeCompression    off;
timeFormat          general;
timePrecision       12;
runTimeModifiable   yes;

libs
(
    "libexternalSpecieDiffusionResistance.so"
);


functions
{
    writeCellVolumes
    {
        type            writeCellVolumes;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    writeCellCentres
    {
        type            writeCellCentres;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    D_CO2
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           D_CO2;
        fieldType       volTensorField;
        writeControl    writeTime;
        expression      "tensor(2e-10, 0, 0, 0, 0, 0, 0, 0, 0)";
        dimensions      [0 2 -1 0 0 0 0];
    }

    D_S
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           D_S;
        fieldType       volTensorField;
        writeControl    writeTime;
        expression      "tensor(4.8e-11, 0, 0, 0, 0, 0, 0, 0, 0)";
        dimensions      [0 2 -1 0 0 0 0];
    }

    k_rxn
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           k_rxn;
        writeControl    writeTime;
        expression      "96.0";
        dimensions      [0 0 -1 0 0 0 0];
    }
        // expression      "pow(10, 11.365-(2211/T)) * pow(10, 0.5*(0.28*S+0.301*S_inlet)+0.134*(S_inlet-S))";

    H_cc
    {
        type            exprField;
        libs            (fieldFunctionObjects);
        field           H_cc;
        writeControl    writeTime;
        expression      "3.25";
        dimensions      [0 0 0 0 0 0 0];
    }

    CO2
    {
        type            aniScalarTransport;
        libs            (solverFunctionObjects);
        writeControl    writeTime;
        field           CO2;
        nut             D_CO2;
        alphaD          0;
        alphaDt         1;

        fvOptions
        {
            reaction
                {
                    type            scalarCodedSource;
                    name            CO2_react;
                    selectionMode   all;
                    fields          (CO2);
                    active          yes;

                    codeOptions
                    #{#};

                    codeConstrain
                    #{#};

                    codeCorrect #{#};

                    codeInclude
                    #{
                        #include "fvCFD.H"
                    #};

                    codeAddSup
                    #{
                        const scalarField& V = mesh_.V();
                        
                        const fvMesh& mesh = eqn.psi().mesh();
                        const volScalarField& k_rxn = mesh.lookupObject<volScalarField>("k_rxn");
                        const volScalarField& S  = mesh.lookupObject<volScalarField>("S");
                        const volScalarField& S_old = S.oldTime();

                        scalarField& Sp = eqn.diag();

                        forAll(Sp, cellI)
                        {
                            const scalar coeff = 2 * k_rxn[cellI] * S_old[cellI];
                            Sp[cellI] -= coeff * V[cellI];
                        }
                    #};
                }
        }
    }

    S
    {
        type            aniScalarTransport;
        libs            (solverFunctionObjects);
        writeControl    writeTime;
        field           S;
        nut             D_S;
        alphaD          0;
        alphaDt         1;

        fvOptions
        {
            reaction
                {
                    type            scalarCodedSource;
                    name            S_react;
                    selectionMode   all;
                    fields          (S);
                    active          yes;

                    codeOptions
                    #{#};

                    codeConstrain
                    #{#};

                    codeCorrect #{#};

                    codeInclude
                    #{
                        #include "fvCFD.H"
                    #};

                    codeAddSup
                    #{
                        const scalarField& V = mesh_.V();
                        
                        const fvMesh& mesh = eqn.psi().mesh();
                        const volScalarField& k_rxn = mesh.lookupObject<volScalarField>("k_rxn");
                        const volScalarField& CO2  = mesh.lookupObject<volScalarField>("CO2");
                        const volScalarField& CO2_old = CO2.oldTime();                       

                        scalarField& Sp = eqn.diag();

                        forAll(Sp, cellI)
                        {
                            const scalar coeff = k_rxn[cellI] * CO2_old[cellI];
                            Sp[cellI] -= coeff * V[cellI];
                        }
                    #};
                }
        }
    }
}

// ************************************************************************* //