v2506/run/verification-studies/diederichsen-and-hatton/fig3/Allrun-serial
##!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -f log.$(getApplication)

runApplication $(getApplication)

#------------------------------------------------------------------------------